In [1]:
import pandas as pd

In [3]:
olym_data = pd.read_csv('E:/datasets/summer.csv')
olym_data.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

### 1. In how many cities Summer Olympics is held so far?

In [11]:
print(olym_data['City'].unique())

['Athens' 'Paris' 'St Louis' 'London' 'Stockholm' 'Antwerp' 'Amsterdam'
 'Los Angeles' 'Berlin' 'Helsinki' 'Melbourne / Stockholm' 'Rome' 'Tokyo'
 'Mexico' 'Munich' 'Montreal' 'Moscow' 'Seoul' 'Barcelona' 'Atlanta'
 'Sydney' 'Beijing']

#### A .  'Athens' 'Paris' 'St Louis' 'London' 'Stockholm' 'Antwerp' 'Amsterdam'
#### 'Los Angeles' 'Berlin' 'Helsinki' 'Melbourne / Stockholm' 'Rome' 'Tokyo'
#### 'Mexico' 'Munich' 'Montreal' 'Moscow' 'Seoul' 'Barcelona' 'Atlanta'
#### 'Sydney' 'Beijing'

### 2. Which sport is having most number of Gold Medals so far? (Top 5)

In [12]:
gold_df = olym_data[olym_data['Medal'] == 'Gold']
gold_df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
6,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,1200M Freestyle,Gold
9,1896,Athens,Aquatics,Swimming,"NEUMANN, Paul",AUT,Men,400M Freestyle,Gold
13,1896,Athens,Athletics,Athletics,"BURKE, Thomas",USA,Men,100M,Gold

In [17]:
gold_df['City'].value_counts()[:5]

London         1223
Athens          723
Los Angeles     696
Beijing         669
Sydney          663
Name: City, dtype: int64

#### A . London, Athens, Los Angeles, Beijing, Sydney

### 3. Which sport is having most number of medals so far? (Top 5)¶

In [20]:
olym_data['Sport'].value_counts()[:5]

Aquatics      4170
Athletics     3638
Rowing        2667
Gymnastics    2307
Fencing       1613
Name: Sport, dtype: int64

#### A. Aquatics, Athletics, Rowing, Gymnastics, Fencing

### 4. Which player has won most number of medals? (Top 5)

In [23]:
olym_data['Athlete'].value_counts()[:5]

PHELPS, Michael         22
LATYNINA, Larisa        18
ANDRIANOV, Nikolay      15
MANGIAROTTI, Edoardo    13
ONO, Takashi            13
Name: Athlete, dtype: int64

### 5. Which player has won most number Gold Medals of medals? (Top 5)

In [24]:
player_gold = olym_data[olym_data['Medal'] == 'Gold']
player_gold.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
6,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,1200M Freestyle,Gold
9,1896,Athens,Aquatics,Swimming,"NEUMANN, Paul",AUT,Men,400M Freestyle,Gold
13,1896,Athens,Athletics,Athletics,"BURKE, Thomas",USA,Men,100M,Gold

In [26]:
player_gold['Athlete'].value_counts()[:5]

PHELPS, Michael     18
LATYNINA, Larisa     9
LEWIS, Carl          9
NURMI, Paavo         9
SPITZ, Mark          9
Name: Athlete, dtype: int64

#### A. PHELPS Michael, LATYNINA Larisa, LEWIS Carl, NURMI Paavo, SPITZ Mark

### 6. In which year India won first Gold Medal in Summer Olympics?

In [31]:
india_df = olym_data[olym_data['Medal'] == 'Gold']
india_df = india_df[india_df['Country'] == 'IND']
india_df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
5512,1928,Amsterdam,Hockey,Hockey,"ALLEN, Richard James",IND,Men,Hockey,Gold
5513,1928,Amsterdam,Hockey,Hockey,"CHAND, Dyan",IND,Men,Hockey,Gold
5514,1928,Amsterdam,Hockey,Hockey,"GATELEY, Maurice A.",IND,Men,Hockey,Gold
5515,1928,Amsterdam,Hockey,Hockey,"GILL, K. S.",IND,Men,Hockey,Gold
5516,1928,Amsterdam,Hockey,Hockey,"GOODSIR-CULLEN, William John",IND,Men,Hockey,Gold

In [32]:
min(india_df['Year'])

1928

#### A. 1928

### 7. Which event is most popular in terms on number of players? (Top 5)

In [37]:
olym_data['Discipline'].value_counts()[:5]

Athletics      3638
Rowing         2667
Swimming       2628
Artistic G.    2103
Fencing        1613
Name: Discipline, dtype: int64

#### A. Athletics, Rowing, Swimming, Artistic G, Fencing

### 8. Which sport is having most female Gold Medalists? (Top 5)

In [38]:
female_df = olym_data[olym_data['Gender'] == 'Women']
female_df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
416,1900,Paris,Golf,Golf,"PRATT, Daria",USA,Women,Individual,Bronze
417,1900,Paris,Golf,Golf,"ABBOTT, Margaret Ives",USA,Women,Individual,Gold
418,1900,Paris,Golf,Golf,"WHITTIER, Pauline",USA,Women,Individual,Silver
639,1900,Paris,Tennis,Tennis,"JONES, Marion",ZZX,Women,Mixed Doubles,Bronze
640,1900,Paris,Tennis,Tennis,"ROSENBAUM, Hedwig",ZZX,Women,Mixed Doubles,Bronze

In [39]:
female_df['Sport'].value_counts()[:5]

Aquatics      1726
Athletics     1163
Gymnastics     799
Rowing         651
Volleyball     497
Name: Sport, dtype: int64

#### A. Aquatics, Athletics, Gymnastics, Rowing, Volleyball